//----------------------------------------------------------------------------
// Example
//----------------------------------------------------------------------------

module mux_2_1
(
  input  [3:0] d0, d1,
  input        sel,
  output [3:0] y
);

  assign y = sel ? d1 : d0;

endmodule

//----------------------------------------------------------------------------
// Task
//----------------------------------------------------------------------------

module mux_4_1
(
  input  [3:0] d0, d1, d2, d3,
  input  [1:0] sel,
  output [3:0] y
);

  // Task:
  // Implement mux_4_1 using three instances of mux_2_1


  wire [3:0] d01; // для выбора между d0 и d1
  mux_2_1 mux2_0 (
    .d0(d0),
    .d1(d1),
    .sel(sel[0]), // когда sel[0] = 0 => d0, когда sel[0] = 1 => d1
    .y(d01) // результат пишем в линию выбора между d0 и d1
  );

  wire [3:0] d23; // для выбора между d2 и d3
  mux_2_1 mux2_1 (
    .d0(d2),
    .d1(d3),
    .sel(sel[0]), // когда sel[0] = 0 => d2, когда sel[0] = 1 => d3
    .y(d23) // результат пишем в линию выбора между d2 и d3
  );

  // для выбора между d01 и d23
  mux_2_1 mux2_2 (
    .d0(d01),
    .d1(d23),
    .sel(sel[1]), // когда sel[1] = 0 => d01 (d0 либо d1), когда sel[1] = 1 => d23 (d2 либо d3)
    .y(y) // результат пишем в линию y
  );
  


endmodule
